def colors(msg, num):
    if num == 1: 
        print(f'\033[7;49;94m{msg}\033[m ')
    elif num == 2:
        print(f'\033[7;49;31m{msg}\033[m ')
    elif num == 3:
        print(f'\033[7;49;92m{msg}\033[m ')
    elif num == 4:
        print(f'\033[5;49;34m{msg}\033[m ')
    elif num == 5:
        print(f'\033[7;49;95m{msg}\033[m ')
    elif num == 6:
        print(f'\033[7;49;91m{msg}\033[m')
    elif num == 7:
        print(f'\033[7;49;90m{msg}\033[m')
    else:
        print(f'\033[7;49;32m{msg}\033[m')
oi = 'oi'
colors(oi, 1)
colors(oi, 2)
colors(oi, 3)
colors(oi, 4)
colors(oi, 5)
colors(oi, 6)
colors(oi, 7)
colors(oi, 8)
print('森森森森森森森森森森森森森森森森森森\
森森森森森森森森森森森森森森森森森森森森森森森 森森森森森\
森森森森森森森森森森森森森森森森森森森森○⩀   ⊞ 森森森森森森森森森森森森森森森森森森森森森森\
森森森森森森森森森森森森森森森森森森森森    /⫎森森森森森森森森森森森森森森森森森森森森森森森\
森森森森森森森森森森森森森森森森森森森森|  |森森森森森森森森森森森森森森森森森森森森森森森森\
森森森森森森森森森森森森森森森森森森森森|  |森森森森森森森森森森森森森森森森森森森森森森森森\
森森森森森森森森森森森森森森森森森森森森|  |森森森森森森森森森森森森森森森森森森森森森森森森\
森森森森森森森森森森森森森森森森森森森森|  |森森森森森森森森森森森森森森森森森森森森森森森森\
森森森森森森森森森森森森森森森森森森森森|  |森森森森森森森森森森森森森森森森森森森森森森森')